window.stations = [
    {
        "name": "Пятницкое шоссе",
        "x": 148,
        "y": 471,
        "w": 199,
        "h": 68
    },
    {
        "name": "Митино",
        "x": 148,
        "y": 596,
        "w": 145,
        "h": 32
    },
    {
        "name": "Волоколамская",
        "x": 147,
        "y": 684,
        "w": 282,
        "h": 32
    },
    {
        "name": "Мякинино",
        "x": 147,
        "y": 779,
        "w": 192,
        "h": 32
    },
    {
        "name": "Строгино",
        "x": 146,
        "y": 866,
        "w": 173,
        "h": 41
    },
    {
        "name": "Крылатское",
        "x": 147,
        "y": 953,
        "w": 215,
        "h": 41
    },
    {
        "name": "Молодежная",
        "x": 147,
        "y": 1040,
        "w": 237,
        "h": 40
    },
    {
        "name": "Кунцевская",
        "x": 146,
        "y": 1141,
        "w": 211,
        "h": 40
    },
    {
        "name": "Пионерская",
        "x": 192,
        "y": 1248,
        "w": 219,
        "h": 40
    },
    {
        "name": "Филевский",
        "x": 192,
        "y": 1326,
        "w": 303,
        "h": 43
    },
    {
        "name": "Багратионовская",
        "x": 192,
        "y": 1409,
        "w": 314,
        "h": 41
    },
    {
        "name": "Фили",
        "x": 192,
        "y": 1490,
        "w": 99,
        "h": 33
    },
    {
        "name": "Кутузовская",
        "x": 192,
        "y": 1573,
        "w": 224,
        "h": 41
    },
    {
        "name": "Международная",
        "x": 209,
        "y": 1679,
        "w": 298,
        "h": 40
    },
    {
        "name": "Выставочная",
        "x": 278,
        "y": 1752,
        "w": 230,
        "h": 33
    },
    {
        "name": "Студенческая",
        "x": 177,
        "y": 1884,
        "w": 251,
        "h": 40
    },
    {
        "name": "Славянский бульвар",
        "x": "88",
        "y": "1989",
        "w": "221",
        "h": 77
    },
    {
        "name": "Парк Победы",
        "x": "323",
        "y": 1988,
        "w": "149",
        "h": 73
    },
    {
        "name": "Планерная",
        "x": 534,
        "y": 470,
        "w": 200,
        "h": 41
    },
    {
        "name": "Сходненская",
        "x": 534,
        "y": 584,
        "w": 234,
        "h": 38
    },
    {
        "name": "Тушинская",
        "x": 533,
        "y": 697,
        "w": 204,
        "h": 41
    },
    {
        "name": "Спартак",
        "x": 532,
        "y": 811,
        "w": 151,
        "h": 40
    },
    {
        "name": "Щукинская",
        "x": 535,
        "y": 924,
        "w": 207,
        "h": 41
    },
    {
        "name": "Октябрьское",
        "x": 534,
        "y": 1035,
        "w": 232,
        "h": 70
    },
    {
        "name": "Полежаевская",
        "x": 535,
        "y": 1186,
        "w": 261,
        "h": 32
    },
    {
        "name": "Беговая",
        "x": 615,
        "y": 1322,
        "w": 142,
        "h": 33
    },
    {
        "name": "Улица 1905 года",
        "x": "510",
        "y": 1513,
        "w": "183",
        "h": 73
    },
    {
        "name": "Деловой центр",
        "x": "635",
        "y": 1740,
        "w": "169",
        "h": 77
    },
    {
        "name": "Динамо",
        "x": 790,
        "y": 1232,
        "w": 147,
        "h": 39
    },
    {
        "name": "Краснопресненская",
        "x": 589,
        "y": 1648,
        "w": 352,
        "h": 41
    },
    {
        "name": "Киевская",
        "x": 771,
        "y": 1889,
        "w": 161,
        "h": 35
    },
    {
        "name": "Спортивная",
        "x": 716,
        "y": 2397,
        "w": 218,
        "h": 40
    },
    {
        "name": "Воробьевы горы",
        "x": 676,
        "y": 2498,
        "w": 305,
        "h": 43
    },
    {
        "name": "Университет",
        "x": 674,
        "y": 2594,
        "w": 241,
        "h": 41
    },
    {
        "name": "Проспект Вернадского",
        "x": 676,
        "y": 2686,
        "w": "249",
        "h": 78
    },
    {
        "name": "Юго-западная",
        "x": 676,
        "y": 2814,
        "w": 267,
        "h": 40
    },
    {
        "name": "Тропарево",
        "x": 673,
        "y": 2929,
        "w": 203,
        "h": 43
    },
    {
        "name": "Бунинская аллея",
        "x": 642,
        "y": 3574,
        "w": 192,
        "h": 67
    },
    {
        "name": "Улица Горчакова",
        "x": 718,
        "y": 3706,
        "w": "200",
        "h": 77
    },
    {
        "name": "Речной вокзал",
        "x": 906,
        "y": 470,
        "w": 266,
        "h": 33
    },
    {
        "name": "Водный стадион",
        "x": 905,
        "y": 592,
        "w": "186",
        "h": 75
    },
    {
        "name": "Сокол",
        "x": 905,
        "y": 873,
        "w": 107,
        "h": 32
    },
    {
        "name": "Аэропорт",
        "x": 902,
        "y": 995,
        "w": 181,
        "h": 41
    },
    {
        "name": "Белорусская",
        "x": 792,
        "y": 1340,
        "w": 228,
        "h": 40
    },
    {
        "name": "Войковская",
        "x": 906,
        "y": 749,
        "w": 211,
        "h": 36
    },
    {
        "name": "Парк культуры",
        "x": 758,
        "y": 2155,
        "w": 268,
        "h": 40
    },
    {
        "name": "Фрунзенская",
        "x": 816,
        "y": 2294,
        "w": 238,
        "h": 40
    },
    {
        "name": "Новослободская",
        "x": 1012,
        "y": 1106,
        "w": 294,
        "h": 37
    },
    {
        "name": "Баррикадная",
        "x": 1007,
        "y": 1531,
        "w": 244,
        "h": 40
    },
    {
        "name": "Тверская",
        "x": 1195,
        "y": 1649,
        "w": 167,
        "h": 40
    },
    {
        "name": "Отрадное",
        "x": 1276,
        "y": 275,
        "w": 180,
        "h": 41
    },
    {
        "name": "Цветной бульвар",
        "x": 1208,
        "y": 1288,
        "w": 314,
        "h": 42
    },
    {
        "name": "Маяковская",
        "x": 1226,
        "y": 1414,
        "w": 217,
        "h": 32
    },
    {
        "name": "Смоленская",
        "x": 1006,
        "y": 1793,
        "w": 214,
        "h": 35
    },
    {
        "name": "Арбатская",
        "x": 1247,
        "y": 1828,
        "w": 188,
        "h": 42
    },
    {
        "name": "Смоленская",
        "x": 1017,
        "y": 1899,
        "w": 204,
        "h": 35
    },
    {
        "name": "Боровицкая",
        "x": 1042,
        "y": 2012,
        "w": 219,
        "h": 40
    },
    {
        "name": "Октябрьская",
        "x": 981,
        "y": 2371,
        "w": 232,
        "h": 41
    },
    {
        "name": "Битцевский парк",
        "x": 909,
        "y": 3464,
        "w": 217,
        "h": 79
    },
    {
        "name": "Кропоткинская",
        "x": 1211,
        "y": 2242,
        "w": 281,
        "h": 40
    },
    {
        "name": "Добрынинская",
        "x": 1220,
        "y": 2511,
        "w": 273,
        "h": 41
    },
    {
        "name": "Шаболовская",
        "x": 1128,
        "y": 2607,
        "w": 245,
        "h": 36
    },
    {
        "name": "Профсоюзная",
        "x": 1125,
        "y": 2827,
        "w": 259,
        "h": 41
    },
    {
        "name": "Калужская",
        "x": 1126,
        "y": 2970,
        "w": 196,
        "h": 40
    },
    {
        "name": "Беляево",
        "x": 1126,
        "y": 3044,
        "w": 149,
        "h": 32
    },
    {
        "name": "Коньково",
        "x": 1126,
        "y": 3115,
        "w": 167,
        "h": 33
    },
    {
        "name": "Теплый Стан",
        "x": 1121,
        "y": 3187,
        "w": 232,
        "h": 33
    },
    {
        "name": "Ясенево",
        "x": 1127,
        "y": 3260,
        "w": 150,
        "h": 36
    },
    {
        "name": "Бульвар Адмирала Ушакова",
        "x": 952,
        "y": 3705,
        "w": "354",
        "h": 78
    },
    {
        "name": "Алтуфьево",
        "x": 1277,
        "y": 93,
        "w": 202,
        "h": 44
    },
    {
        "name": "Бибирево",
        "x": 1279,
        "y": 182,
        "w": 178,
        "h": 42
    },
    {
        "name": "Владыкино",
        "x": 1279,
        "y": 368,
        "w": 207,
        "h": 37
    },
    {
        "name": "Петровско-разумовская",
        "x": 1275,
        "y": 455,
        "w": 442,
        "h": 40
    },
    {
        "name": "Улица Милашенкова",
        "x": 1322,
        "y": 569,
        "w": 169,
        "h": 44
    },
    {
        "name": "Тимирязевская",
        "x": 1276,
        "y": 686,
        "w": 280,
        "h": 40
    },
    {
        "name": "Дмитровская",
        "x": 1277,
        "y": 783,
        "w": 246,
        "h": 41
    },
    {
        "name": "Савеловская",
        "x": 1277,
        "y": 884,
        "w": 228,
        "h": 34
    },
    {
        "name": "Менделеевская",
        "x": 1278,
        "y": 1007,
        "w": 285,
        "h": 38
    },
    {
        "name": "Ленинский проспект",
        "x": 1126,
        "y": 2680,
        "w": 365,
        "h": 41
    },
    {
        "name": "Академическая",
        "x": 1127,
        "y": 2755,
        "w": 285,
        "h": 38
    },
    {
        "name": "Пушкинская",
        "x": 1321,
        "y": 1532,
        "w": 214,
        "h": 40
    },
    {
        "name": "Арбатская",
        "x": 1336,
        "y": 1896,
        "w": 183,
        "h": 42
    },
    {
        "name": "Новые Черемушки",
        "x": 1125,
        "y": 2897,
        "w": 342,
        "h": 42
    },
    {
        "name": "Каховская",
        "x": 1307,
        "y": 3052,
        "w": 180,
        "h": 36
    },
    {
        "name": "Новоясеневская",
        "x": 1162,
        "y": 3341,
        "w": 297,
        "h": 33
    },
    {
        "name": "Лесопарковая",
        "x": 1163,
        "y": 3465,
        "w": 260,
        "h": 40
    },
    {
        "name": "Улица Старокачаловская",
        "x": 1107,
        "y": 3558,
        "w": 335,
        "h": 75
    },
    {
        "name": "Чеховская",
        "x": 1495,
        "y": 1649,
        "w": 190,
        "h": 36
    },
    {
        "name": "Улица Скобелевская",
        "x": 1373,
        "y": 3705,
        "w": 250,
        "h": 69
    },
    {
        "name": "Южная",
        "x": 1571,
        "y": 3213,
        "w": 129,
        "h": 32
    },
    {
        "name": "Аннино",
        "x": 1568,
        "y": 3479,
        "w": 143,
        "h": 35
    },
    {
        "name": "Телецентр",
        "x": 1642,
        "y": 591,
        "w": 127,
        "h": 27
    },
    {
        "name": "Трубная",
        "x": 1638,
        "y": 1232,
        "w": 150,
        "h": 42
    },
    {
        "name": "Кузнецкий мост",
        "x": 1601,
        "y": 1532,
        "w": 299,
        "h": 39
    },
    {
        "name": "Охотный Ряд",
        "x": 1565,
        "y": 1712,
        "w": 162,
        "h": 74
    },
    {
        "name": "Марьина Роща",
        "x": 1649,
        "y": 849,
        "w": 271,
        "h": 40
    },
    {
        "name": "Достоевская",
        "x": 1645,
        "y": 936,
        "w": 232,
        "h": 38
    },
    {
        "name": "Александровский Сад",
        "x": 1397,
        "y": 2012,
        "w": 412,
        "h": 40
    },
    {
        "name": "Библиотека им. Ленина",
        "x": 1419,
        "y": 2118,
        "w": 424,
        "h": 33
    },
    {
        "name": "Полянка",
        "x": 1570,
        "y": 2380,
        "w": 153,
        "h": 33
    },
    {
        "name": "Серпуховская",
        "x": 1563,
        "y": 2552,
        "w": 253,
        "h": 40
    },
    {
        "name": "Тульская",
        "x": 1567,
        "y": 2623,
        "w": 161,
        "h": 40
    },
    {
        "name": "Третьяковская",
        "x": 1643,
        "y": 2208,
        "w": 266,
        "h": 40
    },
    {
        "name": "Нагатинская",
        "x": 1568,
        "y": 2693,
        "w": 230,
        "h": 37
    },
    {
        "name": "Нагорная",
        "x": 1569,
        "y": 2764,
        "w": 172,
        "h": 41
    },
    {
        "name": "Ул. Академика Королева",
        "x": "1731",
        "y": "650",
        "w": "162",
        "h": 47
    },
    {
        "name": "Театральная",
        "x": 1725,
        "y": 1824,
        "w": 231,
        "h": 41
    },
    {
        "name": "Пл. Революции",
        "x": 1682,
        "y": 1952,
        "w": 273,
        "h": 36
    },
    {
        "name": "Нахимовский проспект",
        "x": 1570,
        "y": 2832,
        "w": "257",
        "h": 76
    },
    {
        "name": "Варшавская",
        "x": "1635",
        "y": "2951",
        "w": 222,
        "h": "52"
    },
    {
        "name": "Севастопольская",
        "x": 1567,
        "y": 3063,
        "w": 311,
        "h": 35
    },
    {
        "name": "Чертановская",
        "x": 1568,
        "y": 3138,
        "w": 256,
        "h": 40
    },
    {
        "name": "Пражская",
        "x": 1571,
        "y": 3289,
        "w": 179,
        "h": 40
    },
    {
        "name": "Улица Академика Янгеля",
        "x": 1568,
        "y": 3365,
        "w": 323,
        "h": 70
    },
    {
        "name": "Бульвар Дмитрия Донского",
        "x": 1568,
        "y": 3558,
        "w": "302",
        "h": 121
    },
    {
        "name": "Выставочный Центр",
        "x": "1775",
        "y": "567",
        "w": "220",
        "h": 49
    },
    {
        "name": "Сухаревская",
        "x": 1852,
        "y": 1207,
        "w": 227,
        "h": 40
    },
    {
        "name": "Тургеневская",
        "x": 1673,
        "y": 1455,
        "w": 247,
        "h": 41
    },
    {
        "name": "Сретенский бульвар",
        "x": "1880",
        "y": "1309",
        "w": "223",
        "h": 77
    },
    {
        "name": "Лубянка",
        "x": 1831,
        "y": 1679,
        "w": 150,
        "h": 40
    },
    {
        "name": "Китай-город",
        "x": 1887,
        "y": 1755,
        "w": 236,
        "h": 40
    },
    {
        "name": "Медведково",
        "x": 2044,
        "y": 99,
        "w": 226,
        "h": 38
    },
    {
        "name": "Бабушкинская",
        "x": 2041,
        "y": 204,
        "w": 268,
        "h": 42
    },
    {
        "name": "Свиблово",
        "x": 2043,
        "y": 317,
        "w": 175,
        "h": 35
    },
    {
        "name": "Ботанический сад",
        "x": 2043,
        "y": 432,
        "w": 258,
        "h": 74
    },
    {
        "name": "Улица Сергея Эйзеннштейна",
        "x": "2084",
        "y": 571,
        "w": "153",
        "h": 43
    },
    {
        "name": "Вднх",
        "x": 2046,
        "y": 667,
        "w": 97,
        "h": 39
    },
    {
        "name": "Алексеевская",
        "x": 2046,
        "y": 769,
        "w": 247,
        "h": 35
    },
    {
        "name": "Рижская",
        "x": 2047,
        "y": 862,
        "w": 151,
        "h": 31
    },
    {
        "name": "Проспект Мира",
        "x": 1969,
        "y": 1042,
        "w": 281,
        "h": 40
    },
    {
        "name": "Каширская",
        "x": 2021,
        "y": 2961,
        "w": 204,
        "h": 40
    },
    {
        "name": "Царицынно",
        "x": 2017,
        "y": 3165,
        "w": 195,
        "h": 40
    },
    {
        "name": "Орехово",
        "x": 2019,
        "y": 3254,
        "w": 154,
        "h": 40
    },
    {
        "name": "Красные Ворота",
        "x": "2131",
        "y": 1394,
        "w": "173",
        "h": 76
    },
    {
        "name": "Чистые пруды",
        "x": 2042,
        "y": 1494,
        "w": 260,
        "h": 41
    },
    {
        "name": "Новокузнецкая",
        "x": 2011,
        "y": 2135,
        "w": 271,
        "h": 41
    },
    {
        "name": "Павелецкая",
        "x": 2015,
        "y": 2468,
        "w": 217,
        "h": 38
    },
    {
        "name": "Автозаводская",
        "x": 2016,
        "y": 2657,
        "w": 271,
        "h": 37
    },
    {
        "name": "Коломенская",
        "x": 2018,
        "y": 2855,
        "w": 241,
        "h": 32
    },
    {
        "name": "Комсомольская",
        "x": 2279,
        "y": 1259,
        "w": 284,
        "h": 32
    },
    {
        "name": "Чкаловская",
        "x": 2183,
        "y": 1739,
        "w": 209,
        "h": 35
    },
    {
        "name": "Таганская",
        "x": 2181,
        "y": 2012,
        "w": 180,
        "h": 33
    },
    {
        "name": "Кантемировская",
        "x": 2017,
        "y": 3082,
        "w": 307,
        "h": 41
    },
    {
        "name": "Домодедовская",
        "x": 2019,
        "y": 3337,
        "w": 289,
        "h": 39
    },
    {
        "name": "Бульвар Рокоссовского",
        "x": 2413,
        "y": 472,
        "w": 262,
        "h": 70
    },
    {
        "name": "Черкизовская",
        "x": 2412,
        "y": 628,
        "w": 255,
        "h": 40
    },
    {
        "name": "Преображенская площадь",
        "x": 2415,
        "y": 746,
        "w": 310,
        "h": 77
    },
    {
        "name": "Сокольники",
        "x": 2413,
        "y": 906,
        "w": 217,
        "h": 36
    },
    {
        "name": "Красносельская",
        "x": 2414,
        "y": 1026,
        "w": 291,
        "h": 41
    },
    {
        "name": "Курская",
        "x": 2431,
        "y": 1625,
        "w": 145,
        "h": 40
    },
    {
        "name": "Дубровка",
        "x": 2334,
        "y": 2427,
        "w": 178,
        "h": 43
    },
    {
        "name": "Римская",
        "x": 2443,
        "y": 1862,
        "w": 154,
        "h": 32
    },
    {
        "name": "Марксистская",
        "x": 2429,
        "y": 2134,
        "w": 257,
        "h": 41
    },
    {
        "name": "Крестьянская Застава",
        "x": 2337,
        "y": 2299,
        "w": 240,
        "h": 68
    },
    {
        "name": "Кожуховская",
        "x": 2471,
        "y": 2588,
        "w": 236,
        "h": 41
    },
    {
        "name": "Печатники",
        "x": 2414,
        "y": 2688,
        "w": 198,
        "h": 35
    },
    {
        "name": "Волжская",
        "x": 2413,
        "y": 2788,
        "w": 176,
        "h": 38
    },
    {
        "name": "Люблино",
        "x": 2411,
        "y": 2889,
        "w": 172,
        "h": 37
    },
    {
        "name": "Братиславская",
        "x": 2415,
        "y": 2991,
        "w": 270,
        "h": 39
    },
    {
        "name": "Марьино",
        "x": 2413,
        "y": 3091,
        "w": 165,
        "h": 40
    },
    {
        "name": "Борисово",
        "x": 2415,
        "y": 3192,
        "w": 174,
        "h": 40
    },
    {
        "name": "Шипиловская",
        "x": 2413,
        "y": 3274,
        "w": 253,
        "h": 42
    },
    {
        "name": "Зябликово",
        "x": 2412,
        "y": 3380,
        "w": 195,
        "h": 36
    },
    {
        "name": "Красногвардейская",
        "x": 2248,
        "y": 3499,
        "w": 360,
        "h": 40
    },
    {
        "name": "Щелковская",
        "x": 2786,
        "y": 469,
        "w": 225,
        "h": 40
    },
    {
        "name": "Первомайская",
        "x": 2785,
        "y": 652,
        "w": 267,
        "h": 40
    },
    {
        "name": "Измайловская",
        "x": 2785,
        "y": 781,
        "w": 264,
        "h": 42
    },
    {
        "name": "Партизанская",
        "x": 2786,
        "y": 918,
        "w": 254,
        "h": 41
    },
    {
        "name": "Семеновская",
        "x": 2786,
        "y": 1050,
        "w": 241,
        "h": 37
    },
    {
        "name": "Электрозаводская",
        "x": 2787,
        "y": 1181,
        "w": 335,
        "h": 41
    },
    {
        "name": "Бауманская",
        "x": 2718,
        "y": 1349,
        "w": 216,
        "h": 40
    },
    {
        "name": "Новокосино",
        "x": 2786,
        "y": 1507,
        "w": 221,
        "h": 37
    },
    {
        "name": "Новогиреево",
        "x": 2785,
        "y": 1576,
        "w": 240,
        "h": 41
    },
    {
        "name": "Перово",
        "x": 2786,
        "y": 1648,
        "w": 137,
        "h": 40
    },
    {
        "name": "Шоссе Энтузиастов",
        "x": 2786,
        "y": 1716,
        "w": 231,
        "h": 79
    },
    {
        "name": "Авиамоторная",
        "x": 2723,
        "y": 1849,
        "w": 271,
        "h": 41
    },
    {
        "name": "Площадь Ильича",
        "x": 2645,
        "y": 1921,
        "w": 314,
        "h": 38
    },
    {
        "name": "Пролетарская",
        "x": 2693,
        "y": 2243,
        "w": 257,
        "h": 45
    },
    {
        "name": "Волгоградский проспект",
        "x": 2787,
        "y": 2434,
        "w": "276",
        "h": 79
    },
    {
        "name": "Текстильщики",
        "x": 2783,
        "y": 2553,
        "w": 266,
        "h": 38
    },
    {
        "name": "Кузьминки",
        "x": 2786,
        "y": 2630,
        "w": 199,
        "h": 42
    },
    {
        "name": "Рязанский проспект",
        "x": 2786,
        "y": 2712,
        "w": "222",
        "h": 78
    },
    {
        "name": "Выхино",
        "x": 2787,
        "y": 2832,
        "w": 139,
        "h": 32
    },
    {
        "name": "Лермонтовский проспект",
        "x": 2784,
        "y": 2913,
        "w": 293,
        "h": 78
    },
    {
        "name": "Жулебино",
        "x": 2784,
        "y": 3030,
        "w": 187,
        "h": 43
    },
    {
        "name": "Котельники",
        "x": 2786,
        "y": 3112,
        "w": 214,
        "h": 35
    },
    {
        "name": "Алма-атинская",
        "x": 2665,
        "y": 3499,
        "w": 279,
        "h": 30
    }
];
